app/views/users/show.erb

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = ?  [["user_id", 4]]
---

  <div class="text-center">
    <p class="text-center text-capitalize"><%=@user.username%>'s <%= pluralize(@user.todo_lists.count, 'List') %></p>
      <% @user.todo_lists.each do |t| %>