app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists"
---
  def index
    @todo_lists = TodoList.all

INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "drew"], ["description", "ji jiroej irojiore jiroaj"], ["created_at", "2019-04-09 21:11:55.130317"], ["updated_at", "2019-04-09 21:11:55.130317"], ["user_id", 4.0]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)
    respond_to do |format|
      if @todo_list.save

DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 1]]
---
  def destroy
    @todo_list.destroy