app/controllers/todo_items_controller.rb

  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "new"], ["todo_list_id", 4], ["created_at", "2019-04-09 21:20:17.244336"], ["updated_at", "2019-04-09 21:20:17.244336"], ["user_id", 4.0]]