app/controllers/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "liz"], ["created_at", "2019-04-09 19:38:39.067053"], ["updated_at", "2019-04-09 19:38:39.067053"], ["password_digest", "$2a$10$2ce/0NiqP3Tdez1BJAs/u.nKBmLa5bpsE4fFvEv3sOgVlFhCzF2CS"]]

  def show
    @user=User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]